---
kind: type
id: T:Autodesk.Revit.UI.Selection.Selection
source: html/31b73d46-7d67-5dbb-4dad-80aa597c9afc.htm
---
# Autodesk.Revit.UI.Selection.Selection

Contains the current user selection of elements within the project.

## Syntax (C#)
```csharp
public class Selection : IDisposable
```

## Remarks
The Selection object is used to retrieve the current user selected elements when an external API command is executed.